In [1]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

# Lecture 11 #

## Grouping by Two Columns ##

In [2]:
survey = Table.read_table('welcome_survey_v3.csv')
survey

Year            | Extraversion | Number of Texters | Hours of Sleep | Handedness   | Sleep Side
First           | 2            | 6                 | 8              | Ambidextrous |  back
First           | 7            | 10                | 7              | Ambidextrous |  stomach
Second          | 4            | 5                 | 7              | Ambidextrous |  left side
Third           | 6            | 8                 | 7              | Ambidextrous |  back
Fourth or above | 3            | 4                 | 7              | Ambidextrous |  right side
Second          | 3            | 10                | 6              | Ambidextrous |  left side
Second          | 1            | 3                 | 3              | Ambidextrous |  back
Third           | 2            | 4                 | 6              | Ambidextrous |  stomach
Fourth or above | 8            | 3                 | 6              | Left-handed  |  left side
Fourth or above | 3            | 3                 | 6              | Left-handed  |  right side
... (1234 rows omitted)

In [3]:
survey.group(['Handedness','Sleep Side']).show()

## Pivot Tables ##

In [4]:
# Counts of students by sleep side and handedness
survey.pivot('Sleep Side', 'Handedness')

Handedness   |  back |  left side |  right side |  stomach
Ambidextrous | 3     | 2          | 1           | 2
Left-handed  | 29    | 25         | 30          | 19
Right-handed | 275   | 285        | 380         | 193

Q: How would you compute the average extraversion level within each of these categories?

In [5]:
survey.pivot('Sleep Side', 'Handedness', values='Extraversion', collect=np.average)

Handedness   |  back   |  left side |  right side |  stomach
Ambidextrous | 3       | 3.5        | 3           | 4.5
Left-handed  | 5.75862 | 6.12       | 5.86667     | 6.31579
Right-handed | 5.76364 | 5.71579    | 5.83684     | 5.72021

In [6]:
survey.group('Handedness', np.average)

Handedness   | Year average | Extraversion average | Number of Texters average | Hours of Sleep average | Sleep Side average
Ambidextrous |              | 3.5                  | 6.25                      | 6.375                  |
Left-handed  |              | 5.98058              | 6.93204                   | 7.10194                |
Right-handed |              | 5.76876              | 7.62136                   | 7.01518                |

## Challenge Question ##

In [7]:
nba = Table.read_table('nba_salaries.csv').relabeled(3, 'SALARY')
nba

PLAYER           | POSITION | TEAM          | SALARY
Paul Millsap     | PF       | Atlanta Hawks | 18.6717
Al Horford       | C        | Atlanta Hawks | 12
Tiago Splitter   | C        | Atlanta Hawks | 9.75625
Jeff Teague      | PG       | Atlanta Hawks | 8
Kyle Korver      | SG       | Atlanta Hawks | 5.74648
Thabo Sefolosha  | SF       | Atlanta Hawks | 4
Mike Scott       | PF       | Atlanta Hawks | 3.33333
Kent Bazemore    | SF       | Atlanta Hawks | 2
Dennis Schroder  | PG       | Atlanta Hawks | 1.7634
Tim Hardaway Jr. | SG       | Atlanta Hawks | 1.30452
... (407 rows omitted)

In [8]:
starters_g = nba.drop('PLAYER').group(['POSITION', 'TEAM'], max)
starters_g

POSITION | TEAM                  | SALARY max
C        | Atlanta Hawks         | 12
C        | Boston Celtics        | 2.61698
C        | Brooklyn Nets         | 1.3629
C        | Charlotte Hornets     | 13.5
C        | Chicago Bulls         | 13.4
C        | Cleveland Cavaliers   | 14.2609
C        | Dallas Mavericks      | 5.2
C        | Denver Nuggets        | 5.6135
C        | Detroit Pistons       | 6.5
C        | Golden State Warriors | 13.8
... (137 rows omitted)

In [9]:
starters_g.drop('POSITION').group('TEAM', sum)

TEAM                  | SALARY max sum
Atlanta Hawks         | 48.4181
Boston Celtics        | 25.5689
Brooklyn Nets         | 47.2192
Charlotte Hornets     | 51.9567
Chicago Bulls         | 57.8247
Cleveland Cavaliers   | 82.3166
Dallas Mavericks      | 42.8832
Denver Nuggets        | 36.7789
Detroit Pistons       | 29.525
Golden State Warriors | 66.6431
... (20 rows omitted)

In [10]:
starters_p = nba.pivot('POSITION','TEAM', values='SALARY', collect=max)
starters_p

TEAM                  | C       | PF      | PG      | SF      | SG
Atlanta Hawks         | 12      | 18.6717 | 8       | 4       | 5.74648
Boston Celtics        | 2.61698 | 5       | 7.73034 | 6.79612 | 3.42551
Brooklyn Nets         | 1.3629  | 11.236  | 6.3     | 24.8949 | 3.42551
Charlotte Hornets     | 13.5    | 7       | 12      | 6.3314  | 13.1253
Chicago Bulls         | 13.4    | 5.54373 | 20.0931 | 2.38044 | 16.4075
Cleveland Cavaliers   | 14.2609 | 19.689  | 16.4075 | 22.9705 | 8.98876
Dallas Mavericks      | 5.2     | 15.4937 | 5.37897 | 15.3615 | 1.449
Denver Nuggets        | 5.6135  | 11.236  | 4.345   | 14      | 1.58448
Detroit Pistons       | 6.5     | 0       | 13.913  | 2.84196 | 6.27
Golden State Warriors | 13.8    | 14.2609 | 11.3708 | 11.7105 | 15.501
... (20 rows omitted)

In [11]:
starters_p.with_column('TOTAL', starters_p.drop('TEAM').apply(sum))

TEAM                  | C       | PF      | PG      | SF      | SG      | TOTAL
Atlanta Hawks         | 12      | 18.6717 | 8       | 4       | 5.74648 | 48.4181
Boston Celtics        | 2.61698 | 5       | 7.73034 | 6.79612 | 3.42551 | 25.5689
Brooklyn Nets         | 1.3629  | 11.236  | 6.3     | 24.8949 | 3.42551 | 47.2192
Charlotte Hornets     | 13.5    | 7       | 12      | 6.3314  | 13.1253 | 51.9567
Chicago Bulls         | 13.4    | 5.54373 | 20.0931 | 2.38044 | 16.4075 | 57.8247
Cleveland Cavaliers   | 14.2609 | 19.689  | 16.4075 | 22.9705 | 8.98876 | 82.3166
Dallas Mavericks      | 5.2     | 15.4937 | 5.37897 | 15.3615 | 1.449   | 42.8832
Denver Nuggets        | 5.6135  | 11.236  | 4.345   | 14      | 1.58448 | 36.7789
Detroit Pistons       | 6.5     | 0       | 13.913  | 2.84196 | 6.27    | 29.525
Golden State Warriors | 13.8    | 14.2609 | 11.3708 | 11.7105 | 15.501  | 66.6431
... (20 rows omitted)

## Joins ##

In [20]:
drinks = Table(['Drink', 'Cafe', 'Price']).with_rows([
    ['Milk Tea', 'Tea One', 4],
    ['Espresso', 'Nefeli',  2],
    ['Latte',    'Nefeli',  3],
    ['Espresso', "Abe's",   2]
])
drinks

Drink    | Cafe    | Price
Milk Tea | Tea One | 4
Espresso | Nefeli  | 2
Latte    | Nefeli  | 3
Espresso | Abe's   | 2

In [21]:
discounts = Table().with_columns(
    'Coupon % off', make_array(25, 50, 5),
    'Location', make_array('Tea One', 'Nefeli', 'Tea One')
)
discounts

Coupon % off | Location
25           | Tea One
50           | Nefeli
5            | Tea One

In [22]:
combined = drinks.join('Cafe', discounts, 'Location')
combined

Cafe    | Drink    | Price | Coupon % off
Nefeli  | Espresso | 2     | 50
Nefeli  | Latte    | 3     | 50
Tea One | Milk Tea | 4     | 25
Tea One | Milk Tea | 4     | 5

In [23]:
discounts = combined.with_column('Discounted Price', 
                    combined.column('Price') * (1 - combined.column('Coupon % off') / 100))
discounts

Cafe    | Drink    | Price | Coupon % off | Discounted Price
Nefeli  | Espresso | 2     | 50           | 1
Nefeli  | Latte    | 3     | 50           | 1.5
Tea One | Milk Tea | 4     | 25           | 3
Tea One | Milk Tea | 4     | 5            | 3.8